# Kristen Widman's Brewfile

# To make it so Homebrew can handle Brewfiles:
#   `brew tap Homebrew/bundle`
#   `brew bundle --file=~/.dotfiles/homebrew/.Brewfile`

# Add formulae that duplicate OS X software with updated versions:
tap 'homebrew/dupes'

# Install all the things:

brew 'ag' # Faster grep
brew 'ctags'
brew 'fasd' # Fast directory switcher
brew 'gibo' # quickly access Github's git ignore templates
brew 'git'
brew 'homebrew/dupes/less'
brew 'htop'
brew 'iftop'
brew 'lesspipe' # pre-processes various file formats so they can be paged via Less
brew 'ncdu' # ncurses-based directory/file size viewer
brew 'screen'
brew 'ssh-copy-id'
brew 'stow'
brew 'zsh'

# Install all the databases
brew 'sqlite'
brew 'postgresql'
brew 'mariadb'  # in place of MySQL
brew 'redis'
# brew 'mongo'

# Install Python
brew 'python'
brew 'python3'

# Quicklook plugins
tap 'Caskroom/cask'
brew 'Caskroom/cask/qlstephen'
brew 'Caskroom/cask/betterzipql'
